#### Terraform Format and Style 🖌`success`
#### Terraform Validate ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
 An execution plan has been generated and is shown below. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # aws_default_network_acl.default will be created + resource "aws_default_network_acl" "default" { + arn = (known after apply) + default_network_acl_id = (known after apply) + id = (known after apply) + owner_id = (known after apply) + vpc_id = (known after apply) + egress { + action = "allow" + cidr_block = "0.0.0.0/0" + from_port = 0 + protocol = "-1" + rule_no = 100 + to_port = 0 } + ingress { + action = "allow" + cidr_block = "0.0.0.0/0" + from_port = 0 + protocol = "-1" + rule_no = 100 + to_port = 0 } } # aws_default_security_group.default will be created + resource "aws_default_security_group" "default" { + arn = (known after apply) + description = (known after apply) + egress = [] + id = (known after apply) + ingress = [] + name = (known after apply) + owner_id = (known after apply) + revoke_rules_on_delete = false + vpc_id = (known after apply) } # aws_eip.linux_jumpbox will be created + resource "aws_eip" "linux_jumpbox" { + allocation_id = (known after apply) + association_id = (known after apply) + customer_owned_ip = (known after apply) + domain = (known after apply) + id = (known after apply) + instance = (known after apply) + network_interface = (known after apply) + private_dns = (known after apply) + private_ip = (known after apply) + public_dns = (known after apply) + public_ip = (known after apply) + public_ipv4_pool = (known after apply) + vpc = true } # aws_eip.nat will be created + resource "aws_eip" "nat" { + allocation_id = (known after apply) + association_id = (known after apply) + customer_owned_ip = (known after apply) + domain = (known after apply) + id = (known after apply) + instance = (known after apply) + network_interface = (known after apply) + private_dns = (known after apply) + private_ip = (known after apply) + public_dns = (known after apply) + public_ip = (known after apply) + public_ipv4_pool = (known after apply) + vpc = true } # aws_instance.linux_jumpbox will be created + resource "aws_instance" "linux_jumpbox" { + ami = "ami-0c2f25c1f66a1ff4d" + arn = (known after apply) + associate_public_ip_address = true + availability_zone = (known after apply) + cpu_core_count = (known after apply) + cpu_threads_per_core = (known after apply) + get_password_data = false + host_id = (known after apply) + id = (known after apply) + instance_state = (known after apply) + instance_type = "t3a.nano" + ipv6_address_count = (known after apply) + ipv6_addresses = (known after apply) + key_name = "Marcos_test" + network_interface_id = (known after apply) + outpost_arn = (known after apply) + password_data = (known after apply) + placement_group = (known after apply) + primary_network_interface_id = (known after apply) + private_dns = (known after apply) + private_ip = (known after apply) + public_dns = (known after apply) + public_ip = (known after apply) + security_groups = (known after apply) + source_dest_check = true + subnet_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "Linux_Jumpbox" + "Tier" = "test" } + tenancy = (known after apply) + volume_tags = (known after apply) + vpc_security_group_ids = (known after apply) + credit_specification { + cpu_credits = "standard" } + ebs_block_device { + delete_on_termination = (known after apply) + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + snapshot_id = (known after apply) + volume_id = (known after apply) + volume_size = (known after apply) + volume_type = (known after apply) } + ephemeral_block_device { + device_name = (known after apply) + no_device = (known after apply) + virtual_name = (known after apply) } + metadata_options { + http_endpoint = (known after apply) + http_put_response_hop_limit = (known after apply) + http_tokens = (known after apply) } + network_interface { + delete_on_termination = (known after apply) + device_index = (known after apply) + network_interface_id = (known after apply) } + root_block_device { + delete_on_termination = true + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + volume_id = (known after apply) + volume_size = 8 + volume_type = "standard" } } # aws_instance.testbox[0] will be created + resource "aws_instance" "testbox" { + ami = "ami-07a182edcd7d04084" + arn = (known after apply) + associate_public_ip_address = true + availability_zone = (known after apply) + cpu_core_count = (known after apply) + cpu_threads_per_core = (known after apply) + get_password_data = false + host_id = (known after apply) + id = (known after apply) + instance_state = (known after apply) + instance_type = "t3a.nano" + ipv6_address_count = (known after apply) + ipv6_addresses = (known after apply) + key_name = "Marcos_test" + network_interface_id = (known after apply) + outpost_arn = (known after apply) + password_data = (known after apply) + placement_group = (known after apply) + primary_network_interface_id = (known after apply) + private_dns = (known after apply) + private_ip = (known after apply) + public_dns = (known after apply) + public_ip = (known after apply) + security_groups = (known after apply) + source_dest_check = true + subnet_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "testbox 0" + "Tier" = "test" } + tenancy = (known after apply) + volume_tags = (known after apply) + vpc_security_group_ids = (known after apply) + credit_specification { + cpu_credits = "standard" } + ebs_block_device { + delete_on_termination = (known after apply) + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + snapshot_id = (known after apply) + volume_id = (known after apply) + volume_size = (known after apply) + volume_type = (known after apply) } + ephemeral_block_device { + device_name = (known after apply) + no_device = (known after apply) + virtual_name = (known after apply) } + metadata_options { + http_endpoint = (known after apply) + http_put_response_hop_limit = (known after apply) + http_tokens = (known after apply) } + network_interface { + delete_on_termination = (known after apply) + device_index = (known after apply) + network_interface_id = (known after apply) } + root_block_device { + delete_on_termination = true + device_name = (known after apply) + encrypted = (known after apply) + iops = (known after apply) + kms_key_id = (known after apply) + volume_id = (known after apply) + volume_size = 12 + volume_type = "standard" } } # aws_internet_gateway.IG will be created + resource "aws_internet_gateway" "IG" { + arn = (known after apply) + id = (known after apply) + owner_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-IG" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_key_pair.key will be created + resource "aws_key_pair" "key" { + arn = (known after apply) + fingerprint = (known after apply) + id = (known after apply) + key_name = "Marcos_test" + key_pair_id = (known after apply) + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC0JJvt6hCOM97qciwD/B2c8A+keUipgDHZr7Dcn7fDQedK8B3rF+3TEVTzhs/nvEFdVEz5SXuHst/67i/+cXmV9mrJWuG8h2jh0XD9LBu2d38VisAIQGJgqbayaq+MD43s4kReJ72kNlDCwclCAFi2eVnYddPzh5JPMkWo1S6YTN5NcFk2O34O5tSf73lyt4+0t3ccl0W7rdUGIiFzLx/peBevCijnra5TrhFZrN7wO+q/DMtb0Wm0HJp9lGG1Xo1BaOYGKSFglQSOEXhReBjGH8IsXJzDeQAw7szFSpchQN4igwpeOkrXnVBXWyIoEjesryUMiwkRTKwUb43VyyFw3zJcfRnM9a/ofZAoQ96xL1C/7JIpXKFXPFF+GUXL7zX+xSHjp+4P2ASEc4rJXYXKvWGzvJ+ZpcwBufJ2FqOQ1sraid/qUaPXlUGyivhb2ZhBhLhyZy02u/GrwUehW6J1ARFcG9mk6fDt4owJPTJFDYaFefSQfQoQjP3E02bRxk87zMRNS2qv/USgBYd2yo9jX+2U9LqxzDC6UQ4NVGWbOopobtgNYVX6nVTuqReHiZ1p5kvZhyfvvNLeE7wIKT5FSH2MULcZMUq8G77/qskuoP+DounyvSk12UD9eAFfapLQmUBZ7lkDU9lZ8NyBaedSuxPMv3/cXVqRPoYGjlwxBQ== marcos@zenhub.com" } # aws_nat_gateway.nat will be created + resource "aws_nat_gateway" "nat" { + allocation_id = (known after apply) + id = (known after apply) + network_interface_id = (known after apply) + private_ip = (known after apply) + public_ip = (known after apply) + subnet_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-NATGW-1" + "Tier" = "test" } } # aws_route.private_route will be created + resource "aws_route" "private_route" { + destination_cidr_block = "0.0.0.0/0" + destination_prefix_list_id = (known after apply) + egress_only_gateway_id = (known after apply) + gateway_id = (known after apply) + id = (known after apply) + instance_id = (known after apply) + instance_owner_id = (known after apply) + nat_gateway_id = (known after apply) + network_interface_id = (known after apply) + origin = (known after apply) + route_table_id = (known after apply) + state = (known after apply) } # aws_route.public_route will be created + resource "aws_route" "public_route" { + destination_cidr_block = "0.0.0.0/0" + destination_prefix_list_id = (known after apply) + egress_only_gateway_id = (known after apply) + gateway_id = (known after apply) + id = (known after apply) + instance_id = (known after apply) + instance_owner_id = (known after apply) + nat_gateway_id = (known after apply) + network_interface_id = (known after apply) + origin = (known after apply) + route_table_id = (known after apply) + state = (known after apply) } # aws_route_table.private_table will be created + resource "aws_route_table" "private_table" { + id = (known after apply) + owner_id = (known after apply) + propagating_vgws = (known after apply) + route = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-Private Route Table" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_route_table.public_table will be created + resource "aws_route_table" "public_table" { + id = (known after apply) + owner_id = (known after apply) + propagating_vgws = (known after apply) + route = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-Public Route Table" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_route_table_association.private[0] will be created + resource "aws_route_table_association" "private" { + id = (known after apply) + route_table_id = (known after apply) + subnet_id = (known after apply) } # aws_route_table_association.private[1] will be created + resource "aws_route_table_association" "private" { + id = (known after apply) + route_table_id = (known after apply) + subnet_id = (known after apply) } # aws_route_table_association.public[0] will be created + resource "aws_route_table_association" "public" { + id = (known after apply) + route_table_id = (known after apply) + subnet_id = (known after apply) } # aws_security_group.jumpbox will be created + resource "aws_security_group" "jumpbox" { + arn = (known after apply) + description = "Allow incoming connections." + egress = [ + { + cidr_blocks = [ + "0.0.0.0/0", ] + description = "" + from_port = 0 + ipv6_cidr_blocks = [] + prefix_list_ids = [] + protocol = "-1" + security_groups = [] + self = false + to_port = 0 }, ] + id = (known after apply) + ingress = [ + { + cidr_blocks = [ + "10.1.0.0/16", ] + description = "" + from_port = 0 + ipv6_cidr_blocks = [] + prefix_list_ids = [] + protocol = "-1" + security_groups = [] + self = false + to_port = 0 }, + { + cidr_blocks = [ + "24.84.233.107/32", ] + description = "Marcos Rocha Home" + from_port = 22 + ipv6_cidr_blocks = [] + prefix_list_ids = [] + protocol = "tcp" + security_groups = [] + self = false + to_port = 22 }, ] + name = "test-jumpbox-SG" + owner_id = (known after apply) + revoke_rules_on_delete = false + tags = { + "Creator" = "Marcos" + "Name" = "test-jumpboxSG" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_subnet.private_subnet[0] will be created + resource "aws_subnet" "private_subnet" { + arn = (known after apply) + assign_ipv6_address_on_creation = false + availability_zone = (known after apply) + availability_zone_id = "cac1-az1" + cidr_block = "10.1.1.0/24" + id = (known after apply) + ipv6_cidr_block = (known after apply) + ipv6_cidr_block_association_id = (known after apply) + map_public_ip_on_launch = false + owner_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-Private Subnet 0" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_subnet.private_subnet[1] will be created + resource "aws_subnet" "private_subnet" { + arn = (known after apply) + assign_ipv6_address_on_creation = false + availability_zone = (known after apply) + availability_zone_id = "cac1-az2" + cidr_block = "10.1.2.0/24" + id = (known after apply) + ipv6_cidr_block = (known after apply) + ipv6_cidr_block_association_id = (known after apply) + map_public_ip_on_launch = false + owner_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-Private Subnet 1" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_subnet.public_subnet[0] will be created + resource "aws_subnet" "public_subnet" { + arn = (known after apply) + assign_ipv6_address_on_creation = false + availability_zone = (known after apply) + availability_zone_id = "cac1-az1" + cidr_block = "10.1.3.0/24" + id = (known after apply) + ipv6_cidr_block = (known after apply) + ipv6_cidr_block_association_id = (known after apply) + map_public_ip_on_launch = false + owner_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-Public Subnet 0" + "Tier" = "test" } + vpc_id = (known after apply) } # aws_vpc.VPC will be created + resource "aws_vpc" "VPC" { + arn = (known after apply) + assign_generated_ipv6_cidr_block = false + cidr_block = "10.1.0.0/16" + default_network_acl_id = (known after apply) + default_route_table_id = (known after apply) + default_security_group_id = (known after apply) + dhcp_options_id = (known after apply) + enable_classiclink = (known after apply) + enable_classiclink_dns_support = (known after apply) + enable_dns_hostnames = true + enable_dns_support = true + id = (known after apply) + instance_tenancy = "default" + ipv6_association_id = (known after apply) + ipv6_cidr_block = (known after apply) + main_route_table_id = (known after apply) + owner_id = (known after apply) + tags = { + "Creator" = "Marcos" + "Name" = "test-VPC" + "Tier" = "test" } } Plan: 21 to add, 0 to change, 0 to destroy.```
</details>
*Pusher: @mmurilo, Action: `pull_request`*